bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/BSP_Common/dvp/src/wdr_firmware.c
/*
 * Copyright (c) 2016-2023 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <bl808_isp_wdr.h>
#include "wdr_firmware.h"
#include "bl_img_utils.h"
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <math.h>
#include <string.h>

static void wdr_decide_chroma_suppression(wdr_fw_config_t *config);
static void wdr_hist_pre_process();
static void wdr_decide_curve();
static int  wdr_interpolate_curve(int bin_interp, int bin_lf, int bin_rt, int curve_lf, int curve_rt, int hist_integral[]);
static void wdr_decide_enhancement();
static void wdr_decide_fallback(wdr_fw_config_t *config);
static void wdr_temporal_smooth();
static void wdr_iir_filter(int *iir, int curr, int *result);

#define PIXEL_BW                            (12)
#define PIXEL_MAX                           ((1 << PIXEL_BW) - 1)
#define CHROMA_CENTER                       (1 << (PIXEL_BW - 1))
#define CS_GAIN_PRECISION                   (PIXEL_BW)
#define CS_WEIGHT_PRECISION                 (4)
#define HIST_PIXEL_BW                       (10)        // must be <= PIXEL_BW
#define HIST_PIXEL_MAX                      ((1 << HIST_PIXEL_BW) - 1)
#define BIN_BW                              (6)
#define BIN_NUM                             ((1 << BIN_BW) + 1)
#define HIST_WEIGHT_PRECISION               (HIST_PIXEL_BW - BIN_BW)
#define HIST_WEIGHT_MAX                     (1 << HIST_WEIGHT_PRECISION)
#define ROI_NUM                             (8)
#define ROI_WEIGHT_BW                       (4)
#define ROI_WEIGHT_SUM_MAX                  (ROI_NUM * ((1 << ROI_WEIGHT_BW) - 1))
#define HIST_BW                             (24)
#define HIST_MAX                            ((1 << HIST_BW) - 1)
#define Y_RATIO_INT_BW                      (4)
#define Y_RATIO_FRAC_BW                     (PIXEL_BW)
#define Y_RATIO_BW                          (Y_RATIO_INT_BW + Y_RATIO_FRAC_BW)
#define FALLBACK_PRECISION                  (4)
#define FALLBACK_MAX                        (1 << FALLBACK_PRECISION)
#define CURVE_WEIGHT_PRECISION              (FALLBACK_PRECISION)
#define CURVE_WEIGHT_MAX                    (1 << CURVE_WEIGHT_PRECISION)
#define ENH_GAIN_PRECISION                  (PIXEL_BW)
#define ENH_WEIGHT_PRECISION                (FALLBACK_PRECISION)
#define ENH_WEIGHT_MAX                      (1 << ENH_WEIGHT_PRECISION)

#define HIST_SHIFT_LEVEL                    (HIST_WEIGHT_PRECISION + 6)     // unit: 64 pixels
#define BIN_1ST_QUARTER                     ((BIN_NUM - 1) >> 2)
#define BIN_2ND_QUARTER                     ((BIN_NUM - 1) >> 1)
#define BIN_3RD_QUARTER                     (BIN_1ST_QUARTER * 3)
#define PROTECT_RATIO_PRECISION             (5)
#define PROTECT_RATIO_MAX                   (1 << PROTECT_RATIO_PRECISION)
#define PROTECT_SLOPE_PRECISION             (5)
#define SWING_GAIN_PRECISION                (5)
#define SWING_CLIP_PRECISION                (5)
#define KEEP_BRIGHT_LEVEL_PRECISION         (4)
#define BRIGHT_GAIN_PRECISION               (8)
#define EMPTY_RATIO_PRECISON                (12)
#define ENH_LEVEL_PRECISION                 (5)
#define C_GAIN_RATIO_PRECISION              (5)
#define C_GAIN_SLOPE_PRECISION              (PIXEL_BW)
#define INSIGNIFICANT_BIN_RATIO_PRECISION   (12)
#define FALLBACK_SLOPE_PRECISION            (8)
#define TEMPORAL_SMOOTH_PRECISION           (5)
#define TEMPORAL_IIR_EXTRA_PRECISION        (4)

typedef struct
{
    // chroma suppression
    int cs_en; // r/w, shadow, 1'b
    int cs_grey_th; // r/w, shadow, 8'b, = PIXEL_BW - 4, range: 0 ~ 255
    int cs_gain; // r/w, shadow, 13'b, = 1 + CS_GAIN_PRECISION, fixed-point 1.12, range: 0 ~ (2 ^ 13 - 1), typical: ceil(2048 * (1 << CS_GAIN_PRECISION) / (2048 - cs_grey_th))
    int cs_weight; // r/w, shadow, 5'b, = 1 + CS_WEIGHT_PRECISION, range: 0 ~ 16, 0: disable

    // histogram
    int hist_roi_en[ROI_NUM]; // r/w, shadow, 1'b
    int hist_roi_weight[ROI_NUM]; // r/w, shadow, 4'b, = ROI_WEIGHT_BW, range: 0 ~ 15
    int hist_x_min[ROI_NUM]; // r/w, shadow, 11'b, range: 0 ~ (width - 1)
    int hist_x_max[ROI_NUM]; // r/w, shadow, 11'b, range: 0 ~ (width - 1)
    int hist_y_min[ROI_NUM]; // r/w, shadow, 11'b, range: 0 ~ (height - 1)
    int hist_y_max[ROI_NUM]; // r/w, shadow, 11'b, range: 0 ~ (height - 1)
    ISP_WDR_Hist_Data_Type hist; // r, ping-pong, 24'b, = HIST_BW

    // WDR curve
    int curve_en; // r/w, shadow, 1'b
    int curve_weight; // r/w, shadow, 5'b, = 1 + CURVE_WEIGHT_PRECISION, range: 0 ~ 16, 0: disable
    int curve[BIN_NUM - 1]; // r/w, shadow, 10'b, = HIST_PIXEL_BW, range: 0 ~ 1023, monotonically increasing, i.e. curve[N] <= curve[N + 1]

    // post-enhancement
    int enh_en; // r/w, shadow, 1'b
    int enh_weight; // r/w, shadow, 5'b, = 1 + ENH_WEIGHT_PRECISION, range: 0 ~ 16, 0: disable
    int enh_y_offset; // r/w, shadow, 12'b, = PIXEL_BW, range: 0 ~ 4095
    int enh_y_gain; // r/w, shadow, 15'b, = 3 + ENH_GAIN_PRECISION, fixed-point 3.12, range: 0 ~ (2 ^ 15 - 1)
    int enh_c_gain; // r/w, shadow, 15'b, = 3 + ENH_GAIN_PRECISION, fixed-point 3.12, range: 0 ~ (2 ^ 15 - 1)
} wdr_reg_internal_t;

typedef struct
{
    // chroma suppression
    int fw_cs_en;
    int fw_cs_grey_th;
    int fw_cs_weight; // 0 ~ (2 ^ CS_WEIGHT_PRECISION)

