bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/BSP_Common/dvp/src/wdr_firmware.c
    // histogram pre-processing
    int hist_clip_level;

    // WDR curve
    int fw_curve_en;
    int exclude_over_under_exp_en;
    int swing_gain;
    int swing_clip; // 0 ~ (2 ^ SWING_CLIP_PRECISION)
    int protect_slope;
    int curve_keep_bright_level; // 0 ~ (2 ^ KEEP_BRIGHT_LEVEL_PRECISION)
    int bright_gain;

    // post-enhancement
    int fw_enh_en;
    int empty_ratio;
    int enh_keep_bright_level; // 0 ~ (2 ^ KEEP_BRIGHT_LEVEL_PRECISION)
    int dark_enh_level; // 0 ~ (2 ^ ENH_LEVEL_PRECISION)
    int bright_enh_level; // 0 ~ (2 ^ ENH_LEVEL_PRECISION)
    int enh_c_gain_base;
    int enh_c_gain_extra_slope;

    // fallback
    int fw_fallback_en;
    int peak_sum_range;
    int peak_sum_th;
    int peak_sum_slope;
    int insignificant_bin_ratio;
    int insignificant_bin_num_th;
    int insignificant_bin_num_slope;

    // temporal smoothing
    int temporal_smooth; // 0 ~ ((2 ^ TEMPORAL_SMOOTH_PRECISION) - 1)
} wdr_fw_param_t;

/* TODO: optimize mem usage*/
static wdr_reg_internal_t wdr_reg;
static wdr_reg_internal_t wdr_reg_fw_curr;
static wdr_reg_internal_t wdr_reg_fw_iir;
static wdr_fw_param_t     wdr_fw_param;

static int fw_hist_shift[BIN_NUM];
static int fw_hist_clip[BIN_NUM];
static int fw_hist_clip_integral[BIN_NUM + 1];
static int hist_shift_total;

static void wdr_set_hist(int xmax, int ymax)
{
    // histogram
    for (int ir = 0; ir < ROI_NUM; ir++) {
        wdr_reg.hist_roi_en[ir] = (ir == 0) ? 1 : 0;
        wdr_reg.hist_roi_weight[ir] = 1;
        wdr_reg.hist_x_min[ir] = 0;
        wdr_reg.hist_x_max[ir] = xmax;
        wdr_reg.hist_y_min[ir] = 0;
        wdr_reg.hist_y_max[ir] = ymax;
    }
}

static void wdr_set_reg_default(void)
{
    // chroma suppression
    wdr_reg.cs_en = 0;
    wdr_reg.cs_grey_th = 0;
    wdr_reg.cs_gain = 1 << CS_GAIN_PRECISION;
    wdr_reg.cs_weight = 0;

    // histogram
    wdr_set_hist(1919, 1079);

    // WDR curve
    wdr_reg.curve_en = 0;
    wdr_reg.curve_weight = 0;

    for (int ib = 0; ib < BIN_NUM - 1; ib++) {
        wdr_reg.curve[ib] = ib << HIST_WEIGHT_PRECISION;
    }

    // post-enhancement
    wdr_reg.enh_en = 0;
    wdr_reg.enh_weight = 0;
    wdr_reg.enh_y_offset = 0;
    wdr_reg.enh_y_gain = 1 << ENH_GAIN_PRECISION;
    wdr_reg.enh_c_gain = 1 << ENH_GAIN_PRECISION;
}

static void wdr_fw_param_init(void)
{
  // typical ROI setting
  // for (int ir = 0; ir < ROI_NUM; ir++)
  // {
  //   wdr_reg.hist_roi_en[ir] = (ir == 0) ? 1 : 0;
  //   wdr_reg.hist_roi_weight[ir] = 1;
  //   wdr_reg.hist_x_min[ir] = 0;
  //   wdr_reg.hist_x_max[ir] = width - 1;
  //   wdr_reg.hist_y_min[ir] = 0;
  //   wdr_reg.hist_y_max[ir] = height - 1;
  // }

  // chroma suppression
    wdr_fw_param.fw_cs_en = 1;
    wdr_fw_param.fw_cs_grey_th = 3 << (PIXEL_BW - 8);
    wdr_fw_param.fw_cs_weight = 8;

    // histogram pre-processing
    wdr_fw_param.hist_clip_level = BIN_BW - 1;

    // WDR curve
    wdr_fw_param.fw_curve_en = 1;
    wdr_fw_param.exclude_over_under_exp_en = 1;
    wdr_fw_param.swing_gain = 18;
    wdr_fw_param.swing_clip = 14;
    wdr_fw_param.protect_slope = 48;
    wdr_fw_param.curve_keep_bright_level = 4;
    wdr_fw_param.bright_gain = 256;

    // post-enhancement
    wdr_fw_param.fw_enh_en = 1;
    wdr_fw_param.empty_ratio = 20;
    wdr_fw_param.enh_keep_bright_level = 4;
    wdr_fw_param.dark_enh_level = 26;
    wdr_fw_param.bright_enh_level = 26;
    wdr_fw_param.enh_c_gain_base = 34;
    wdr_fw_param.enh_c_gain_extra_slope = 48;

    // fallback
    wdr_fw_param.fw_fallback_en = 1;
    wdr_fw_param.peak_sum_range = 1;
    wdr_fw_param.peak_sum_th = 35;
    wdr_fw_param.peak_sum_slope = 82;
    wdr_fw_param.insignificant_bin_ratio = 8;
    wdr_fw_param.insignificant_bin_num_th = 50;
    wdr_fw_param.insignificant_bin_num_slope = 164;

    // temporal smoothing
    wdr_fw_param.temporal_smooth = 22;

    // initialize IIR
    wdr_reg_fw_iir.cs_grey_th = 0;
    wdr_reg_fw_iir.cs_gain = 1 << CS_GAIN_PRECISION;
    wdr_reg_fw_iir.cs_weight = 0;

    wdr_reg_fw_iir.curve_weight = 0;

    for (int ib = 0; ib < BIN_NUM - 1; ib++) {
        wdr_reg_fw_iir.curve[ib] = ib << HIST_WEIGHT_PRECISION;
    }

    wdr_reg_fw_iir.enh_weight = 0;
    wdr_reg_fw_iir.enh_y_offset = 0;
    wdr_reg_fw_iir.enh_y_gain = 1 << ENH_GAIN_PRECISION;
    wdr_reg_fw_iir.enh_c_gain = 1 << ENH_GAIN_PRECISION;

    // increase IIR register precision to avoid permanent residue
    wdr_reg_fw_iir.cs_grey_th <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.cs_gain <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.cs_weight <<= TEMPORAL_IIR_EXTRA_PRECISION;

    wdr_reg_fw_iir.curve_weight <<= TEMPORAL_IIR_EXTRA_PRECISION;

    for (int ib = 0; ib < BIN_NUM - 1; ib++) {
        wdr_reg_fw_iir.curve[ib] <<= TEMPORAL_IIR_EXTRA_PRECISION;
    }

    wdr_reg_fw_iir.enh_weight <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.enh_y_offset <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.enh_y_gain <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.enh_c_gain <<= TEMPORAL_IIR_EXTRA_PRECISION;
}

static void wdr_hw_init(void)
{
    ISP_WDR_Set_CS_State(ENABLE);
    ISP_WDR_Set_WDR_Curve_State(ENABLE);
    ISP_WDR_Set_Post_Enhance_State(ENABLE);
}

void wdr_hw_update(void)
{
    int i;
    ISP_WDR_Curve_Type wdr_curve;
    ISP_Chroma_Suppress_Type cs_cfg;
    // apply wdr curve
    for (i = 0; i < ISP_WDR_CURVE_COEF_NUM; i++) {
        wdr_curve.curve_coef[i] = wdr_reg.curve[i];
    }

    cs_cfg.gain = wdr_reg.cs_gain;
    cs_cfg.weight = wdr_reg.cs_weight;
    cs_cfg.gain_thresh = wdr_reg.cs_grey_th;

    ISP_WDR_Set_CS_Config(&cs_cfg);
    ISP_WDR_Set_WDR_Curve(&wdr_curve);
    ISP_WDR_Set_WDR_Curve_Weight(wdr_reg.curve_weight);
    ISP_WDR_Set_Post_Enhance_Weight(wdr_reg.enh_weight);
    ISP_WDR_Set_Post_Enhance_Y_Offset(wdr_reg.enh_y_offset);
    ISP_WDR_Set_Post_Enhance_Luma_Gain(wdr_reg.enh_y_gain);
    ISP_WDR_Set_Post_Enhance_Chroma_Gain(wdr_reg.enh_c_gain);
}

int wdr_control(wdr_fw_config_t *config)
{
    // run after each frame hardware done (WDR interrupt)
    wdr_decide_chroma_suppression(config);
    wdr_hist_pre_process();
    wdr_decide_curve();
    wdr_decide_enhancement();
    wdr_decide_fallback(config);
    wdr_temporal_smooth();

